ConnectTest/src/InformationRegisters/acquiringOrdersQueue/acquiringOrdersQueue.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>acquiringOrdersQueue</name>
  <resources>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>orderState</name>
    <type>
      <types>EnumRef.acquiringOrderStates</types>
    </type>
  </resources>
  <dimensions>
    <name>order</name>
    <type>
      <types>CatalogRef.acquiringOrders</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConnectTest/src/Enums/informationChannels/informationChannels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>informationChannels</name>
  <enumValues>
    <name>pushEmployee</name>
  </enumValues>
  <enumValues>
    <name>pushCustomer</name>
  </enumValues>
  <enumValues>
    <name>sms</name>
  </enumValues>
  <enumValues>
    <name>email</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/Enums/acquiringOrderStates/acquiringOrderStates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>acquiringOrderStates</name>
  <enumValues>
    <name>send</name>
  </enumValues>
  <enumValues>
    <name>success</name>
  </enumValues>
  <enumValues>
    <name>rejected</name>
  </enumValues>
  <enumValues>
    <name>done</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/Catalogs/messages/messages.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>messages</name>
  <attributes>
    <name>action</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>appType</name>
    <type>
      <types>EnumRef.appTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>gym</name>
    <type>
      <types>CatalogRef.gyms</types>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>objectId</name>
    <comment>Идентификатор документа/рассылки, по которому отправлено
			сообщение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>objectType</name>
    <comment>Идентификатор документа/рассылки, по которому отправлено
			сообщение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>priority</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>text</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>title</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>token</name>
    <type>
      <types>CatalogRef.tokens</types>
    </type>
  </attributes>
  <attributes>
    <name>user</name>
    <comment>Определяется если пользователь зарегистирован в МП</comment>
    <type>
      <types>CatalogRef.users</types>
    </type>
  </attributes>
  <tabularSections>
    <name>channelPriorities</name>
    <attributes>
      <name>channel</name>
      <type>
        <types>EnumRef.informationChannels</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ConnectTest/src/CommonModules/Jobs/Module.bsl
Procedure sendSMS() Export
	Messages.sendMessages(Enums.informationChannels.sms);
EndProcedure

Procedure sendPush() Export
	Messages.sendMessages(Enums.informationChannels.pushEmployee);
	Messages.sendMessages(Enums.informationChannels.pushCustomer);
EndProcedure

Procedure checkSmsStatus() Export		
	nodeMessagesToCheckStatus	= GeneralReuse.nodeMessagesToCheckStatus(Enums.informationChannels.sms);
	query	= New Query();
	query.text	= "SELECT DISTINCT
	|	messages.Ref.holding AS holding
	|FROM
	|	Catalog.messages.Changes AS messages
	|WHERE
	|	messages.node = &node";	
	query.SetParameter("node", nodeMessagesToCheckStatus);	
	selection	= query.Execute().Select();	
	While selection.Next() Do
		Messages.checkHoldingSmsStatus(nodeMessagesToCheckStatus, selection.holding);
	EndDo;
EndProcedure 

Procedure РассчитатьПоказатели() Export
	Service.РассчитатьПоказатели();
EndProcedure

Procedure alertSourceInformation() Export
	Service.informationSourceAlert();
EndProcedure

Procedure ПроверитьАктуальностьТокенов() Export
	Service.ПроверитьАктуальностьТокенов();
EndProcedure

Procedure CheckAcquiringStatus() Export
	OrdersToCheck = GetOrdersToCheck();
	While OrdersToCheck.Next() Do
		response = Acquiring.executeRequest("check", OrdersToCheck.order);
		If response = Undefined Then
			  Acquiring.addOrderToQueue(OrdersToCheck.order, Enums.acquiringOrderStates.send);		
		Else
			If response.errorCode = "" Then
				Acquiring.addOrderToQueue(OrdersToCheck.order, Enums.acquiringOrderStates.success);
				Acquiring.executeRequestBackground("process", OrdersToCheck.order);
			EndIf;
		EndIf;
	EndDo;
EndProcedure

Function GetOrdersToCheck()
	Query = New Query();
	Query.Text = "SELECT TOP 100
	|	acquiringOrdersQueue.order
	|FROM
	|	InformationRegister.acquiringOrdersQueue AS acquiringOrdersQueue
	|WHERE
	|	acquiringOrdersQueue.orderState = VALUE(Enum.acquiringOrderStates.send)
	|	AND acquiringOrdersQueue.registrationDate < DATEADD(&CurrentDate, Minute, -20)
	|ORDER BY
	|	acquiringOrdersQueue.registrationDate";
	Query.Parameters.Insert("CurrentDate", ToUniversalTime(CurrentDate()));
	Return Query.Execute().Select();
EndFunction
